#include<stdio.h>

/******************************************************************/
//int Add(int *Tem)
//{
//	int c = 10;
//	c += *Tem;
//	printf("c : %d\n", c);
//	*Tem = 1;
//}
//int main()     //函数传参
//{
//	int a = 10;
//	int* pa = &a;
//	Add(pa);
//	printf("%d\n", a);
//	return 0;
//}
/******************************************************************/

/******************************************************************/
//int main()             //用指针判断字符串长度
//{
//	char arr1[] = "hello";
//	char *p;
//	int count = 0;
//	for (p = arr1; *p != '\0'; p++)
//	{
//		count++;
//	}
//	printf("%d", count);
//	return 0;
//}
/******************************************************************/


/******************************************************************/
int strlen_my(char arr[])
{
	char count = 0;
	char* p1;
	for (p1 = arr; *p1 != '\0'; p1++)
		{
			count++;
		}
	return count;
}

int main()             //对上个程序的调整（将判断内容用函数来实现）
{
	char arr1[] = "hello";
	char* p=arr1;
	int count = strlen_my(arr1);//数组名是数组首元素的地址
	printf("%d", count);
	return 0;
}
/******************************************************************/