#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <string.h>

/***********************************************************/
//int Add(int x, int y)
//{	
//	int z = 0;
//	z = x + y;
//	return z;
//}
//
//int main()
//{
//	int a1 = 0;
//	int a2 = 0;
//	scanf_s("%d%d", &a1, &a2);
//
//	int sum = Add(a1, a2);
//	printf("%d", sum);
//	return 0;
//}
/***********************************************************/


/***********************************************************/
//int main()
//{
//	char arr1[5] ="hello";//定义数组时中括号里的数字代表数组中元素的个数，而非引用时的标号
//	char arr[11] = {0,2,3,4};
//	printf("%d\n", sizeof(arr));//数组中未赋值的空间填充0
//	printf("%c", arr1[4]);
//	return 0;
//} 
/***********************************************************/

/***********************************************************/
//int main()
//{
//	char arr1[5] = "hello";
//	char arr2[20] = { 0 };
//	printf("%s", arr1);
//	strcpy(arr2,arr1);//把字符串1放到字符串2中
//	printf("%s",arr2);
//	return 0;
//}
/***********************************************************/

/***********************************************************/
//int main()
//{
//	char arr1[5] = "hello";
//	memset(arr1,'a', 2);//复制字符 c（一个无符号字符）到参数 str 所指向的字符串的前 n 个字符。
//	printf("%s", arr1);
//	return 0;
//}
/***********************************************************/

/***********************************************************/
int a = 10;
int b = 20;

void swap()
{
	int z;
	z = a;
	a = b;
	b = z;
}

int main()
{
	scanf("%d %d",& a, &b);
	printf("交换前：%d,%d", a, b);
	swap();
	printf("交换后：%d,%d",a,b);
	return 0;
}
/***********************************************************/

/***********************************************************/
//int main()
//{
//	char arr[10] = { 0 };
//	arr[1] = 127;//数组中元素的大小范围是由定义数组时指定的数组的类型来决定的
//	printf("%d", arr[1]);
//	return 0;
//}
/***********************************************************/
