#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

int main()
{
	/********************************************************************/
	//char arr3[10] = {0};
	//scanf("%s",&arr3);
	//printf("arr3:%s\n", arr3);
	//char arr[] ="hello";//直接用字符串赋值给数组
	//printf("arr:%s\n", arr); 
	//char arr1[] = {'a','b','c','d','\0'};//在数组中赋值，注意\0结尾
	//printf("arr1:%s\n", arr1);
	//char arr2[] = { 'a','b','c','d'};//无'\0' ,因此后边会打印出乱码
	//printf("arr2:%s\n", arr2);
	//printf("%d\n",strlen(arr));//打印字符串arr的长度
	//printf("%d\n",strlen(arr1));//打印字符串arr1的长度
	//printf("%d\n", strlen(arr2));//这个打印出来的长度不是4！！是随机数
	/********************************************************************/
	

	/********************************************************************/
	//int sz = sizeof(arr2) / sizeof(arr2[0]);//!!!!!计算数组的长度注意区分是计算数组的长度还是计算字符串的长度
	//printf("%d\n", sz);//这里打印的是一个固定的数，因为arr2中的字符的个数是确定的
	/*******************************************************************/


	return 0;
}